<?php

namespace App\Classes;

class News
{
    protected $allNewses;
    protected $result = [];

    public function index ()
    {
        return [
            0 => [
                'id' => 1,
                'category_id' => '1',
                'title' => 'রাস্তায় ম্যাজিস্ট্রেটকে মারধর করে আটক প্রবাসী',
                'description' => 'পুলিশ কর্মকর্তা মোখলেসুর রহমান বলেন, নগরের জিইসি মোড় এলাকায় স্ত্রীকে নিয়ে হাঁটছিলেন ওই ম্যাজিস্ট্রেট। এ সময় একটি',
                'time' => '১ ঘণ্টা আগে',
                'image' => 'assets/img/n1.jpg'
            ],

            1 => [
                'id' => 2,
                'category_id' => '1',
                'title' => 'পয়লা ফাল্গুন ও ভালোবাসা দিবস / বসন্তে রঙিন রাজধানী',
                'description' => 'বসন্তের রঙে রঙিন হলো রাজধানী।',
                'time' => '১ ঘণ্টা আগে',
                'image' => 'assets/img/n2.jpg'
            ],

            2 => [
                'id' => 3,
                'category_id' => '1',
                'title' => 'চট্টগ্রামে মীনা বাজারকে ৩ লাখ টাকা জরিমানা',
                'description' => 'চসিকের নির্বাহী ম্যাজিস্ট্রেট বলেন, মীনা বাজারে নিম্নমানের খাদ্যপণ্য বিক্রি হচ্ছিল। এ ছাড়া বেকারি পণ্যের মেয়াদ ছিল না। ছিল না স্বাস্থ্যবিধির বালাই। এসব অপরাধে সুপারশপ',
                'time' => '৩ ঘণ্টা আগে',
                'image' => 'assets/img/n3.jpg'
            ],

            3 => [
                'id' => 4,
                'category_id' => '2',
                'title' => 'উত্তর প্রদেশের ভোটে এবার হিন্দুত্ববাদের পরীক্ষা',
                'description' => 'উত্তর প্রদেশের সঙ্গে গতকাল সোমবার ভোট হলো উত্তরাখন্ড ও গোয়াতেও। বিকেল পাঁচটা পর্যন্ত উত্তর প্রদেশে ভোট পড়ে ৬০ শতাংশের কিছু',
                'time' => '২ ঘণ্টা আগে',
                'image' => 'assets/img/b1.jpg'
            ],

            4 => [
                'id' => 5,
                'category_id' => '2',
                'title' => 'কর্ণাটকে হিজাব–বিতর্ক চলছেই',
                'description' => 'হিজাব–বিতর্কের মধ্যেই বিজেপিশাসিত ভারতের দক্ষিণি রাজ্য কর্ণাটকের কিছু স্কুল কর্তৃপক্ষ মুসলিম ছাত্রীদের গতকাল সোমবার হিজাব খুলে স্কুলে',
                'time' => '৩ ঘণ্টা আগে',
                'image' => 'assets/img/b2.jpg'
            ],

            5 => [
                'id' => 6,
                'category_id' => '2',
                'title' => 'যুক্তরাষ্ট্রে খ্যাপাটে যাত্রীর জন্য উড়োজাহাজের জরুরি অবতরণ',
                'description' => 'যুক্তরাষ্ট্রের ফেডারেল ব্যুরো অব ইনভেস্টিগেশন (এফবিআই) ঘটনার সত্যতা স্বীকার করেছে। এক বিবৃতিতে এফবিআই বলেছে, এ ঘটনায় ওই',
                'time' => '৫ ঘণ্টা আগে',
                'image' => 'assets/img/b3.jpg'
            ],

            6 => [
                'id' => 7,
                'category_id' => '3',
                'title' => 'শ্রমিকের ডিজিটাল তথ্যভান্ডার করবে সরকার',
                'description' => 'ডিজিটাল তথ্যভান্ডার হলে কোন খাতে কত শ্রমিক কাজ করেন, তার প্রকৃত সংখ্যা জানা যাবে। শ্রমিকদের সব ধরনের সুযোগ-সুবিধা প্রদান',
                'time' => '৬ ঘণ্টা আগে',
                'image' => 'assets/img/bu1.jpg'
            ],

            7 => [
                'id' => 8,
                'category_id' => '3',
                'title' => 'নতুন নির্দেশনা জারি / কেন্দ্রীয় ব্যাংকের চেকের বিপরীতে ঋণ ছাড় নয়',
                'description' => 'কোনো কোনো আর্থিক প্রতিষ্ঠান ঋণের টাকা ছাড় করাতে বাংলাদেশ ব্যাংকের চেক ব্যবহার করছে। এর মাধ্যমে বাংলাদেশ ব্যাংকে রক্ষিত ওই আর্থিক',
                'time' => '৯ ঘণ্টা আগে',
                'image' => 'assets/img/bu2.jpg'
            ],

            8 => [
                'id' => 9,
                'category_id' => '3',
                'title' => 'ফুলের ব্যবসা / যশোরের কৃষক হাসে ফুল চাষে',
                'description' => 'ফুলচাষি হযরত আলী ৭৫০টি গোলাপ ফুল নিয়ে যশোরের ঝিকরগাছা উপজেলার গদখালী পাইকারি ফুলের মোকামে যান। সকাল আটটার',
                'time' => '৯ ঘণ্টা আগে',
                'image' => 'assets/img/bu3.jpg'
            ],
        ];
    }

    public function someNews ($newsId)
    {
        $this->allNewses = $this->index();
        foreach ($this->allNewses as $news)
        {
            if ($news['category_id'] == $newsId)
            {
                array_push($this->result, $news);
            }
        }
        return $this->result;
    }

    public function getNewsDetails($newsId)
    {
        $this->allNewses = $this->index();
        foreach ($this->allNewses as $news)
        {
            if ($news['id'] == $newsId)
            {
                return $news;
            }
        }
    }
}